'Game_mode0': {
        name: 'ßð ×àëëû',
        locationsNumb: 5,
        scoreModifier: 1,
        mapCentre: [8, { lat: 55.7258687, lng: 52.2013311 }],
        locations: [
		{
			'name': 'Ðîäèíà-Ìàòü',
			'latLng': { lat: 55.6888176, lng: 52.304616 }
		},
		{
			'name': 'Ïàìÿòíèê Âëàäèìèðó Âûñîöêîìó',
			'latLng': { lat: 55.6878867, lng: 52.2887902 }
		},
		{
			'name': 'Áóëüâàð Ýíòóçèàñòîâ',
			'latLng': { lat: 55.743477, lng: 52.4186151 }
		},
		{
			'name': 'Ìýðèÿ ãîðîäà',
			'latLng': { lat: 55.741849, lng: 52.4004557 }
		},
		{
			'name': 'Ïëîùàäü Àçàòëûê',
			'latLng': { lat: 55.7409096, lng: 52.4041328 }
		},
		{
			'name': 'Íàáåðåæíàÿ â Íîâîì ãîðîäå',
			'latLng': { lat: 55.7394435, lng: 52.3646223 }
		},
		{
			'name': 'Óë. Öåíòðàëüíàÿ',
			'latLng': { lat: 55.6996959, lng: 52.3162337 }
		},
		{
			'name': 'Ëåäîâûé äâîðåö è Sunrise City',
			'latLng': { lat: 55.7533887, lng: 52.4106218 }
		},
		{
			'name': 'ÄÊ "ÊÀÌÀÇ"',
			'latLng': { lat: 55.7562135, lng: 52.4294984 }
		},
		{
			'name': 'Àê Áàòûð',
			'latLng': { lat: 55.7442907, lng: 52.4207223 }
		},
		{
			'name': 'Ñêâåð èì. Ãàáäóëëû Òóêàÿ',
			'latLng': { lat: 55.7360987, lng: 52.4035469 }
		},
		{
			'name': 'Êîìñîìîëüñêèé ïàðê',
			'latLng': { lat: 55.6824527, lng: 52.2879822 }
		},
		{
			'name': 'Ìå÷åòü Íóð-Èõëàñ',
			'latLng': { lat: 55.7673772, lng: 52.4177691 }
		},
		{
			'name': 'ÇÀÃÑ',
			'latLng': { lat: 55.7532584, lng: 52.3914429 }
		},
		{
			'name': 'Õðàì Êîñìû è Äàìèàíà è öåðêîâü Àíäðåÿ Ðóáë¸âà',
			'latLng': { lat: 55.7135653, lng: 52.365767 }
		}
	]}
