'Game_mode0': {
name: 'Яр Чаллы',
locationsNumb: 5,
scoreModifier: 1,
mapCentre: [8, { lat: 55.7258687, lng: 52.2013311 }],
locations: [
{
'name': 'Родина-Мать',
'latLng': { lat: 55.6888176, lng: 52.304616 }
},
{
'name': 'Памятник Владимиру Высоцкому',
'latLng': { lat: 55.6878867, lng: 52.2887902 }
},
{
'name': 'Бульвар Энтузиастов',
'latLng': { lat: 55.743477, lng: 52.4186151 }
},
{
'name': 'Мэрия города',
'latLng': { lat: 55.741849, lng: 52.4004557 }
},
{
'name': 'Площадь Азатлык',
'latLng': { lat: 55.7409096, lng: 52.4041328 }
},
{
'name': 'Набережная в Новом городе',
'latLng': { lat: 55.7394435, lng: 52.3646223 }
},
{
'name': 'Ул. Центральная',
'latLng': { lat: 55.6996959, lng: 52.3162337 }
},
{
'name': 'Ледовый дворец и Sunrise City',
'latLng': { lat: 55.7533887, lng: 52.4106218 }
},
{
'name': 'ДК "КАМАЗ"',
'latLng': { lat: 55.7562135, lng: 52.4294984 }
},
{
'name': 'Ак Батыр',
'latLng': { lat: 55.7442907, lng: 52.4207223 }
},
{
'name': 'Сквер им. Габдуллы Тукая',
'latLng': { lat: 55.7360987, lng: 52.4035469 }
},
{
'name': 'Комсомольский парк',
'latLng': { lat: 55.6824527, lng: 52.2879822 }
},
{
'name': 'Мечеть Нур-Ихлас',
'latLng': { lat: 55.7673772, lng: 52.4177691 }
},
{
'name': 'ЗАГС',
'latLng': { lat: 55.7532584, lng: 52.3914429 }
},
{
'name': 'Храм Космы и Дамиана и церковь Андрея Рубл ва',
'latLng': { lat: 55.7135653, lng: 52.365767 }
}
]}
