let game_modes = {
	'Game_mode1': [
		{
			'name': 'Москва',
			'latLng': { lat: 55.7538594, lng: 37.6206391 }
		},
		{
			'name': 'Санут-Петербург',
			'latLng': { lat: 59.9395103, lng: 30.3151588 }
		},
		{
			'name': 'Казань',
			'latLng': { lat: 55.7989683, lng: 49.1047278 }
		},
		{
			'name': 'Нижний Новгород',
			'latLng': { lat: 56.326008, lng: 44.0045733 }
		},
		{
			'name': 'Самара',
			'latLng': { lat:53.2037017, lng: 50.1111999 }
		},
		{
			'name': 'Екатеринбург',
			'latLng': { lat: 56.8387546, lng: 60.6044939 }
		},
		{
			'name': 'Иркутск',
			'latLng': { lat: 52.2800306, lng: 104.2816579 }
		},
		{
			'name': 'Сочи',
			'latLng': { lat: 43.6716604, lng: 40.2966411 }
		},
		{
			'name': 'Ярославль',
			'latLng': { lat: 57.6190439, lng: 39.8714151 }
		},
		{
			'name': 'Владивосток',
			'latLng': { lat: 43.1132434, lng: 131.8907829 }
		},
		{
			'name': 'Калининград',
			'latLng': { lat: 54.706665, lng: 20.5113333 }
		},
		{
			'name': 'Архангельск',
			'latLng': { lat: 64.5439575, lng: 40.5107735 }
		},
		{
			'name': 'Пермь',
			'latLng': { lat: 58.0097, lng: 56.2396 }
		},
		{
			'name': 'Новосибирск',
			'latLng': { lat: 55.0306117, lng: 82.9205044 }
		},
		{
			'name': 'Краснодар',
			'latLng': { lat: 45.0463314, lng: 38.9783778 }
		},
		{
			'name': 'Набережные Челны',
			'latLng': {lat: 55.7420274, lng: 52.4154197 }
		},
		{
			'name': 'Саранск',
			'latLng': { lat: 54.1824509, lng: 45.1815652 }
		},
		{
			'name': 'Челябинск',
			'latLng': { lat: 55.1571582, lng: 61.4026938 }
		},
		{
			'name': 'Великий Устюг',
			'latLng': { lat: 60.7609484, lng: 46.3001601 }
		},
		{
			'name': 'Норильск',
			'latLng': { lat: 69.3411014, lng: 88.2096248 }
		},
		{
			'name': 'Петропавловск-Камчатский',
			'latLng': { lat: 53.0238876, lng: 158.6388855 }
		}
	],
	'Game_mode2': [
		{
			'name': 'Троицкий мост',
			'latLng': { lat: 59.9468837, lng: 30.3291378 }
		},
		{
			'name': 'Литейный мост',
			'latLng': { lat: 59.9508667, lng: 30.3493337 }
		},
		{
			'name': 'Дворцовый мост',
			'latLng': { lat: 59.9410713, lng: 30.3082885 }
		},
		{
			'name': 'Благовещенский мост',
			'latLng': { lat: 59.9346505, lng: 30.2895389 }
		},
		{
			'name': 'Тучков мост',
			'latLng': { lat: 59.9490079, lng: 30.2857113 }
		},
		{
			'name': 'Мост Бетанкура',
			'latLng': { lat: 59.9561468, lng: 30.2651087 }
		},
		{
			'name': 'Биржевой мост',
			'latLng': { lat: 59.9463115, lng: 30.3034866 }
		},
		{
			'name': 'Большеохтинский мост',
			'latLng': { lat: 59.9427087, lng: 30.4011907 }
		},
		{
			'name': 'Мост Александра Невского',
			'latLng': { lat: 59.9256516, lng: 30.3956367 }
		},
		{
			'name': 'Володарский мост',
			'latLng': { lat: 59.8776915, lng: 30.4535447 }
		},
		{
			'name': 'Большой Обуховский (Вантовый) мост',
			'latLng': { lat: 59.8537553, lng: 30.4916825 }
		},
		{
			'name': 'Большой Петровский мост',
			'latLng': { lat: 59.9650621, lng: 30.2549998 }
		},
		{
			'name': 'Лазаревский мост',
			'latLng': { lat: 59.9651244, lng: 30.2738374 }
		},
		{
			'name': 'Каменоостровский мост',
			'latLng': { lat: 59.9774967, lng: 30.3012994 }
		},
		{
			'name': 'Ушаковский мост',
			'latLng': { lat: 59.982548, lng: 30.3000831 }
		},
		{
			'name': 'Мост Ломоносова',
			'latLng': { lat: 59.9284032, lng: 30.3357683 }
		},
		{
			'name': 'Итальянский мост',
			'latLng': { lat: 59.9373, lng: 30.3270001 }
		},
		{
			'name': 'Поцелуев мост',
			'latLng': { lat: 59.9282183, lng: 30.2949978 }
		},
		{
			'name': 'Львиный Мостик',
			'latLng': { lat: 59.9271083, lng: 30.3015032 }
		},
		{
			'name': 'Синий мост',
			'latLng': { lat: 59.9315095, lng: 30.3082482 }
		}
	],
	'Game_mode3': [
		{
			'name': 'Сергиев Посад',
			'latLng': { lat: 56.310116, lng: 38.1298335 }
		},
		{
			'name': 'Переславль-Залесский',
			'latLng': { lat: 56.7361264, lng: 38.8524575 }
		},
		{
			'name': 'Ростов',
			'latLng': { lat: 57.1843974, lng: 39.4149331 }
		},
		{
			'name': 'Ярославль',
			'latLng': { lat: 57.6228236, lng: 39.8924097 }
		},
		{
			'name': 'Кострома',
			'latLng': { lat: 57.7772125, lng: 40.894648 }
		},
		{
			'name': 'Иваново',
			'latLng': { lat: 57.0150469, lng: 40.9688925 }
		},
		{
			'name': 'Суздаль',
			'latLng': { lat: 56.4274938, lng: 40.4404642 }
		},
		{
			'name': 'Владимир',
			'latLng': { lat: 56.1266469, lng: 40.3970226 }
		}
	]
};
